[
    {
        "name":"Difference between javascript and nodejs.",
        "des": "Javascript is a simple programming language that is used to write script for website. Js can run any browser which support JS engine like V8 engine, Spider monkey etc. Node JS is Javascript runtime environment which is made with V8 engine and some C++ files. That's why JS can run outside the browser with the help of Node JS. JS can use both client and server side. but JS mostly used for client side. Node JS mostly used on server side. Some JS frameworks are RamdaJS, TypedJS etc. Some Nodejs modules are Lodash, express etc. ",
        "img": "https://i.ibb.co/JsSRxG4/js-node.png"
    },
    {
        "name":"When should you use nodejs and when should you use mongodb..?",
        "des": "Nodejs can ensure great speed and performance. Nodejs is good for those environment which have heavy traffic like realtime messaging, chat room when messages are displayed to many users at a time. Nodejs capable of handling large data flows. Nodejs can easily integrate with IoT protocols. means Nodejs is very good for IoT device. Nodejs is also good for data streaming application. streaming means sending large amount of data in smaller package instead of a single batch. Nodejs is perfectly suited for this type of task. On the other hand Mongodb are a very good choice when data is document centric and does not fit well into the schema of a relational database, when need to accommodate massive scale, when you are rapidly prototyping.",
        "img": "https://i.ibb.co/4t8VG49/modemongo.png"
    },
    {
        "name":"Differences between SQL and NoSQL databases.",
        "des": "SQL or Structured Query Language are called RDBMS means it is Relational database management system. It is a table based database. it is vertically scalable. SQL support ACID (atomicity, consistency, isolation, durability) properties. Joins is required in SQL. SQL are best for complex query. Whereas NoSQL or Not Structured Query Language are called Non Relational database management system. NoSQL are document based Database system. It is horizontally scalable.  NoSQL support CAP (consistency, availability, partition tolerance) properties. NoSQL does not require Joins. NoSQL are not good for complex queries. ",
        "img": "https://i.ibb.co/qWbB41j/sql-nosql.png"
    },
    {
        "name":"What is the purpose of jwt and how does it work..?",
        "des": "JWT or JSON Web Token is an open standard used to share information or API data securely between a client and a server. It is a token based stateless authentication mechanism. The token is mainly compose three things. Header, payload, signature. These 3 parts are separated by dots(.). JWT define the signature of the information we are sending from one party to another and it comes in two forms. one is Serialized and other one is Deserialized. The serialized is mainly used to transfer the data through the network with each req and res. while the deserialized approach is used to read and write data to the web token.",
        "img": "https://i.ibb.co/bgyv49H/jwt.png"
    }
]